# UDACITY- DATA ANALYTICS Nanodegree- Exploring Weather Trends

Importing all necessary packages for the project

In [115]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as pb
import seaborn
import sys
%matplotlib inline

Importing city_list.csv

In [116]:
city_list=pd.read_csv("D:/SRM books/Online Courses/UDACITY/Data Analyst Nanodegree/MODULE 1/Explore Weather Trends/city_list.csv")

In [117]:
city_list.head()

        city               country
0    Abidjan         Côte D'Ivoire
1  Abu Dhabi  United Arab Emirates
2      Abuja               Nigeria
3      Accra                 Ghana
4      Adana                Turkey

Importing city_data.csv

In [118]:
city_data=pd.read_csv("D:/SRM books/Online Courses/UDACITY/Data Analyst Nanodegree/MODULE 1/Explore Weather Trends/city_data.csv")

In [119]:
city_data.head()

   year     city        country  avg_temp
0  1849  Abidjan  Côte D'Ivoire     25.58
1  1850  Abidjan  Côte D'Ivoire     25.52
2  1851  Abidjan  Côte D'Ivoire     25.67
3  1852  Abidjan  Côte D'Ivoire       NaN
4  1853  Abidjan  Côte D'Ivoire       NaN

Importing global_data.csv

In [120]:
global_data=pd.read_csv("D:/SRM books/Online Courses/UDACITY/Data Analyst Nanodegree/MODULE 1/Explore Weather Trends/global_data.csv")

In [121]:
global_data.head()

   year  avg_temp
0  1750      8.72
1  1751      7.98
2  1752      5.78
3  1753      8.39
4  1754      8.47

Separating out _Bangalore, India_ from _city_data_  DataFrame

In [122]:
bangalore= city_data[city_data['city']=='Bangalore']

In [123]:
print(bangalore)

      year       city country  avg_temp
6367  1796  Bangalore   India     24.49
6368  1797  Bangalore   India     25.18
6369  1798  Bangalore   India     24.65
6370  1799  Bangalore   India     24.81
6371  1800  Bangalore   India     24.85
...    ...        ...     ...       ...
6580  2009  Bangalore   India     25.73
6581  2010  Bangalore   India     25.71
6582  2011  Bangalore   India     25.36
6583  2012  Bangalore   India     26.04
6584  2013  Bangalore   India     26.61

[218 rows x 4 columns]

In [124]:
bangalore.to_csv("D:/SRM books/Online Courses/UDACITY/Data Analyst Nanodegree/MODULE 1/Explore Weather Trends/bangalore.csv")

In [125]:
bangalore1= pd.DataFrame(bangalore, columns = ['year', 'city', 'avg_temp'])
bangalore1.head()

      year       city  avg_temp
6367  1796  Bangalore     24.49
6368  1797  Bangalore     25.18
6369  1798  Bangalore     24.65
6370  1799  Bangalore     24.81
6371  1800  Bangalore     24.85

In [126]:
bangalore2=bangalore1.copy()

In [127]:
bangalore2.head()

      year       city  avg_temp
6367  1796  Bangalore     24.49
6368  1797  Bangalore     25.18
6369  1798  Bangalore     24.65
6370  1799  Bangalore     24.81
6371  1800  Bangalore     24.85

Columns present in _bangalore2_ dataframe

In [128]:
bangalore2.columns

Index(['year', 'city', 'avg_temp'], dtype='object')

In [129]:
bangalore2.head()

      year       city  avg_temp
6367  1796  Bangalore     24.49
6368  1797  Bangalore     25.18
6369  1798  Bangalore     24.65
6370  1799  Bangalore     24.81
6371  1800  Bangalore     24.85

In [130]:
global_data.isnull().any()

year        False
avg_temp    False
dtype: bool

In [131]:
bangalore2.isnull().any()

year        False
city        False
avg_temp     True
dtype: bool

In [132]:
bangalore2['avg_temp'].isnull().sum()

7

In [133]:
bangalore2['avg_temp'].fillna(method='bfill')

6367    24.49
6368    25.18
6369    24.65
6370    24.81
6371    24.85
        ...
6580    25.73
6581    25.71
6582    25.36
6583    26.04
6584    26.61
Name: avg_temp, Length: 218, dtype: float64

In [134]:
bangalore2.head()

      year       city  avg_temp
6367  1796  Bangalore     24.49
6368  1797  Bangalore     25.18
6369  1798  Bangalore     24.65
6370  1799  Bangalore     24.81
6371  1800  Bangalore     24.85

In [135]:
bangalore2[10:30]

      year       city  avg_temp
6377  1806  Bangalore     24.87
6378  1807  Bangalore     24.25
6379  1808  Bangalore       NaN
6380  1809  Bangalore       NaN
6381  1810  Bangalore       NaN
6382  1811  Bangalore       NaN
6383  1812  Bangalore       NaN
6384  1813  Bangalore     24.23
6385  1814  Bangalore     23.91
6386  1815  Bangalore     23.79
6387  1816  Bangalore     23.30
6388  1817  Bangalore     23.60
6389  1818  Bangalore     23.94
6390  1819  Bangalore     23.86
6391  1820  Bangalore     23.91
6392  1821  Bangalore     24.40
6393  1822  Bangalore     24.33
6394  1823  Bangalore     24.62
6395  1824  Bangalore     25.10
6396  1825  Bangalore     24.69

In [136]:
bangalore2['avg_temp'].fillna(method='pad', inplace=True)

In [137]:
bangalore2[10:30]

      year       city  avg_temp
6377  1806  Bangalore     24.87
6378  1807  Bangalore     24.25
6379  1808  Bangalore     24.25
6380  1809  Bangalore     24.25
6381  1810  Bangalore     24.25
6382  1811  Bangalore     24.25
6383  1812  Bangalore     24.25
6384  1813  Bangalore     24.23
6385  1814  Bangalore     23.91
6386  1815  Bangalore     23.79
6387  1816  Bangalore     23.30
6388  1817  Bangalore     23.60
6389  1818  Bangalore     23.94
6390  1819  Bangalore     23.86
6391  1820  Bangalore     23.91
6392  1821  Bangalore     24.40
6393  1822  Bangalore     24.33
6394  1823  Bangalore     24.62
6395  1824  Bangalore     25.10
6396  1825  Bangalore     24.69

In [155]:
global1= global_data[ (global_data['year']>1795) & (global_data['year']<2014) ]

In [156]:
global1.head()

    year  avg_temp
46  1796      8.27
47  1797      8.51
48  1798      8.67
49  1799      8.51
50  1800      8.48

Total no.of entries in global1 and bangalore2

In [157]:
len(global1) == len(bangalore2)

True

In [159]:
global1.head()

    year  avg_temp
46  1796      8.27
47  1797      8.51
48  1798      8.67
49  1799      8.51
50  1800      8.48

In [160]:
global1.reset_index(inplace = True, drop = True)

In [161]:
global1.head()

   year  avg_temp
0  1796      8.27
1  1797      8.51
2  1798      8.67
3  1799      8.51
4  1800      8.48

In [162]:
bangalore2.head()

      year       city  avg_temp
6367  1796  Bangalore     24.49
6368  1797  Bangalore     25.18
6369  1798  Bangalore     24.65
6370  1799  Bangalore     24.81
6371  1800  Bangalore     24.85

In [163]:
bangalore2.reset_index(inplace = True, drop = True)

In [164]:
bangalore2.head()

   year       city  avg_temp
0  1796  Bangalore     24.49
1  1797  Bangalore     25.18
2  1798  Bangalore     24.65
3  1799  Bangalore     24.81
4  1800  Bangalore     24.85

In [166]:
global1.to_csv("D:/SRM books/Online Courses/UDACITY/Data Analyst Nanodegree/MODULE 1/Explore Weather Trends/global_final.csv")
bangalore2.to_csv("D:/SRM books/Online Courses/UDACITY/Data Analyst Nanodegree/MODULE 1/Explore Weather Trends/bangalore_final.csv")

## Moving Average Calculations

In [171]:
global1["m_avg"]= global1['avg_temp'].rolling(window=10).mean()
global1.head()

D:\Softwares Installed\Anaconda3 5.0.1 (64bit)\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

   year  avg_temp  m_avg
0  1796      8.27    NaN
1  1797      8.51    NaN
2  1798      8.67    NaN
3  1799      8.51    NaN
4  1800      8.48    NaN

In [174]:
bangalore2["m_avg"]= bangalore2['avg_temp'].rolling(window=10).mean()
bangalore2.head()

   year       city  avg_temp  m_avg
0  1796  Bangalore     24.49    NaN
1  1797  Bangalore     25.18    NaN
2  1798  Bangalore     24.65    NaN
3  1799  Bangalore     24.81    NaN
4  1800  Bangalore     24.85    NaN